#include<stdio.h>
#include<stdlib.h>

int main()	//求一个4位数每个对应位上的数字
{
	/**************************************************************/
	/*
		根据每个位上的权值使用5则运算求出1234每个位上的数字

		运行结果如下：
		千位上值为1
		百位上值为2
		十位上值为3
		个位上值为4
	*/
	/**************************************************************/
	int n;
	printf("input: ");
	scanf("%d", &n);
	if (n < 1000 || n > 9999)
	{
		printf("input error! USAGE: n -> 1000-9999\n");
		return 1;
	}
	
	printf("千位上的数字：%d\n", n / 1000);
	n %= 1000;

	printf("百位上的数字：%d\n", n / 100);
	n %= 100;

	printf("十位上的数字：%d\n", n / 10);
	n %= 10;

	printf("个位上的数字：%d\n", n / 1);
	n %= 1;		//n==0作为结束条件

	system("pause");
	return 0;
}